#Задача «Самая простая задача на свете».
number = int(input("Введите натуральное число: "))
word_users = "Купи конструктор!"
print(word_users * number )
# Задача «Автоматизируем простоту!».
number = int(input("Введите натуральное число: "))
word_users = str(input("Введите любимое дело:"))
print(word_users * number )